#### SQL And SQLite
SQL (Structured Query Language) is a standard language for managing and manipulating relational databases. SQLite is a self-contained, serverless, and zero-configuration database engine that is widely used for embedded database systems.

In [24]:
import sqlite3

In [25]:
## Connect to an SQLite database
connection=sqlite3.connect('./example.db')
connection

In [26]:
cursor=connection.cursor()

In [27]:
## Create a Table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')

## Commit the changes
connection.commit()

In [5]:
cursor.execute('''
Select * from employees    
''')

In [6]:
## Insert the data in sqlite table
cursor.execute('''
Insert Into employees(name,age,department) values('Steve',25,'Data Science')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Keith', 25, 'Engineering')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Michael', 35, 'Finance')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Michael', 35, 'Finance')
''')

cursor.execute('''
INSERT INTO employees (name, age, department) VALUES ('Francis', 55, 'HR')
''')

## commit the changes
connection.commit()

In [7]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()
## print the queried data
for row in rows:
    print(row)

(1, 'Steve', 25, 'Data Science')
(2, 'Keith', 25, 'Engineering')
(3, 'Michael', 35, 'Finance')
(4, 'Michael', 35, 'Finance')
(5, 'Francis', 55, 'HR')

In [8]:
## Update the data in the table
cursor.execute('''
UPDATE employees Set age=40 where name="Steve"
''')
connection.commit()

In [9]:
## Query the data from the table
cursor.execute('Select id, Name, age from employees')
rows=cursor.fetchall()
## print the queried data
for row in rows:
    print(row)

(1, 'Steve', 40)
(2, 'Keith', 25)
(3, 'Michael', 35)
(4, 'Michael', 35)
(5, 'Francis', 55)

In [10]:
## Delete the data from the table
cursor.execute('''
Delete from employees where name ='Michael' and id = 3
''')

connection.commit()

In [11]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Steve', 40, 'Data Science')
(2, 'Keith', 25, 'Engineering')
(4, 'Michael', 35, 'Finance')
(5, 'Francis', 55, 'HR')

In [30]:
## Working with Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('./sales_data1.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    salesdate DATE NOT NULL,
    product TEXT NOT NULL,
    price INTEGER,
    region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(salesdate,product,price,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [31]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [33]:
# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS product (
    id INTEGER PRIMARY KEY,
    mfd DATE NOT NULL,
    product text NOT NULL,
    cprice INTEGER
)
''')

# Insert data into the sales table
product_data = [
    ('2022-11-01', 'Product1', 80),
    ('2021-12-02', 'Product2', 170),
    ('2022-10-03', 'Product3', 130),
    ('2022-09-04', 'Product4', 200),
    ('2023-01-01', 'Product5', 250)
]

cursor.executemany('''
Insert into product(mfd,product,cprice)
                   values(?,?,?)
''',product_data)

connection.commit()

In [34]:
# Query data from the sales table
cursor.execute('SELECT * FROM product')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2022-11-01', 'Product1', 80)
(2, '2021-12-02', 'Product2', 170)
(3, '2022-10-03', 'Product3', 130)
(4, '2022-09-04', 'Product4', 200)
(5, '2023-01-01', 'Product5', 250)

In [35]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [36]:
cursor.execute('SELECT name FROM sqlite_master WHERE type=\'table\' ')

rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

('sales',)
('product',)

In [37]:
cursor.execute('SELECT product.mfd, product.product, product.cprice, sales.salesdate, sales.price FROM product INNER JOIN sales ON product.product = sales.product')

rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

('2022-11-01', 'Product1', 80, '2023-01-01', 100)
('2022-11-01', 'Product1', 80, '2023-01-03', 150)
('2021-12-02', 'Product2', 170, '2023-01-02', 200)
('2021-12-02', 'Product2', 170, '2023-01-05', 300)
('2022-10-03', 'Product3', 130, '2023-01-04', 250)

In [39]:
cursor.execute('''
    SELECT product.mfd, product.product, product.cprice, sales.salesdate, sales.price 
    FROM product 
    LEFT JOIN sales 
    ON product.product = sales.product
    '''
)

rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

('2022-11-01', 'Product1', 80, '2023-01-01', 100)
('2022-11-01', 'Product1', 80, '2023-01-03', 150)
('2021-12-02', 'Product2', 170, '2023-01-02', 200)
('2021-12-02', 'Product2', 170, '2023-01-05', 300)
('2022-10-03', 'Product3', 130, '2023-01-04', 250)
('2022-09-04', 'Product4', 200, None, None)
('2023-01-01', 'Product5', 250, None, None)

In [20]:
## close the connection
connection.close()

In [21]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.